bareStaticDrift/system/surface/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-beta                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/surface";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes
{
    default       Euler;
}

divSchemes
{
    div(phis,eta) Gauss linearUpwind grad(eta);
}

gradSchemes
{
    grad(eta)     cellLimited Gauss linear 1;
}

laplacianSchemes
{
}


// ************************************************************************* //
