bareStaticDrift/system/surface/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-beta                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/surface";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    eta
    {
        solver          PBiCG;//smoothSolver;
//        smoother        DILUGaussSeidel;
        tolerance       1e-06;
        relTol          0.001;
        minIter         1;
        preconditioner  DILU;
    }

}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        eta            1;
    }
}


// ************************************************************************* //
